[
  {
    "Amazon": [
      1,
      "Philips BT1212/15 USB charging cordless rechargeable Beard Trimmer\n",
      "₹ 840.00",
      {
        "Highlights": [
          "Up to 30 minutes of cordless use after 8 hours charging; Cutter width:32 mm\n",
          "USB charging for convenient use - comes with a USB cable for more flexible charging via your computer or any USB adaptor. The adaptor is not included\n",
          "Choose beard lengths of 1-5-7mm or the zero trim look\n",
          "Long lasting performance - 2 years worldwide warranty\n",
          "Skin friendly blades with rounded tip to prevent irritation\n",
          "Detachable head for easy cleaning\n",
          "Contact_us on: 1800 102 2929, Email ID: customercare.india@philips.com for product related queries\n"
        ]
      },
      {
        "Reviews": [
          "  All you need to know before buying this trimmerPros:* Powerful* Sturdy* Sharp and Precise* Ergonomic Shape and Easy to use.* 5 trims in one charge* Usb type charging* Easy to cleanCons:* Charger not provided (only cable is provided)* Charging takes 8 hours.* Only 3 sizes (1mm, 5mm, 7mm)In the process of buying this trimmer, I went through a lot of web surfing. Here is what I found.Brand: No doubt Philips is the best brand for trimmer and shaver as of now.Why Trimmer, and not Shaver or Hybrid of both?This was one of the main doubts. Weather one should go for a trimmer, a shaver or a hybrid of both. Electric shavers does feel pretty smooth and leave less cuts on skin, but don’t give shaves as close a a razor. If one wants to trim, you’ll anyways need a trimmer. More over, you’ll have to wait for 8 hours of charging to get shaved which can easily be done by a razor too which I think is a big trade off. Hybrid devices can do both shaving and trimming but then they are very expensive with price of almost 4k and above. At this price you can buy both a trimmer and a shaver separately. A philips trimmer price varies from 800 to 2000. Also besides trimming, it can do a job close to shaving. Hence going with a trimmer is a better option.Why BT-1212?This is the lower end model among philips trimmers. The upper end model gave a better battery backup (45min/10hr charge, 60min/10hr charge, 60min/60 min charge) where the price went upto Rs 2000. But we don’t have to trim on a daily basis and one use won’t require more than 5-7 min of operation. So 60min of operation is not really a requirement for trimmer. Next talking about blades, I was using a philips trimmer before and it went on working for 5 years. So there is not such difference between titanium coated blades and normal self sharpening blades. My point is, the price difference between BT-1212 did not justified the value addition by battery backup and titanium blades since these not really make a difference in our trimming experience.\n",
          "  I had use this product only one time , after that it is not working ..... really I don't expect this from a company like Philips.  Really I don't know to clime warranty\n",
          "  Product is good; but is hasn't charger, only data cable is given.  I am using my mobile charger for it's charging\n",
          "  I just use this on the minimum setting everyday. I dont miss shaving with razors at all. It lasts around 3 to 4 beard trims, before i need to attach it to my laptop and charge it again. I havent yet attached it to a powerbank to see if it will charge that way. Will that work?\n"
        ]
      },
      2,
      "MI Cordless Beard Trimmer 1C, with 20 length settings, 60 MInutes of usage, & USB Fast charging\n",
      "₹ 899.00",
      {
        "Highlights": [
          "Blade Material: Self sharpening Stainless steel blades\n",
          "Length Settings: 20 length settings with 0.5mm precision\n",
          "Run Time and Charging Time: Ultra powerful Battery with upto 60min of cordless usage with 2hour charge time\n",
          "Travel Safe with the Travel lock feature\n",
          "Perfect grip, Easier to use and more efficient\n",
          "LED Battery Indicator gives the battery status as and when the device is switched on\n",
          "Box contents-Trimmer, Micro USB Charging Cable (No adapter) ,One Comb ,Cleaning Brush and Travel Pouch\n",
          "Warranty: One year pan-India warranty on all Manufacturing defects. To claim, please go with the original bill to an authorised service center of Xiaomi/ call 18001036286\n"
        ]
      },
      {
        "Reviews": [
          "  This is worst product it broked into pieces just in one use will honestly suggest to notbuy this as they are not replacing it total money waste\n",
          "  I was using a philips trimmer and bought this after reading reviews. Im very impressed with product. I happened to use and i had an awesome trim.. It fits perfectly in ur hand and the charge drain is very little..\n",
          "  Let me tell you something straight, the length settings, build quality and performance given by this trimmer is unmatched in this price range. Moreover, the trimmer is sleek and charger is micro usb, thus I don't have to carry a separate charger. Go for it blindly. You won't be disappointed.\n",
          "  Awesome product from MI for this Price range.ADVANTAGES:1. Good design2. Battery level Indicator3. 20 length settings4. Handy design5. Micro USB port and cable is also included6. Self sharping bladesDISADVANTAGE:1. This model doesn't have a travel lock2. Low battery backup, we should charge for 2hrs and can use for the only 1hr3. There are no spare or replaceable blades for this product4. In case of any damage to blades, we have to buy another trimmer instead of a replacement.5. This model doesn't have Waterproof material. We can't able to wash the trimmer. But, can be cleaned using brushHope this review will be helpful for the beginners 😇....This product is best for me in this price range. I have bought this for only 899rs.I suggest this product for the beginner and people under budget 👍🏻\n"
        ]
      },
      3,
      "Philips BT3203/15 cordless rechargeable Beard Trimmer - 10 length settings; 45 min run time\n",
      "₹ 1,199.00",
      {
        "Highlights": [
          "Up to 45 minutes of cordless use after10 hours charging\n",
          "10 lock-in length settings and cutting length of the product is 0.5mm-10mm with 1mm precision\n",
          "Easy to use: Cordless use. Automatic voltage: 100-240 V\n",
          "30% faster trimming with Lift and Cut System\n",
          "Long lasting performance - 2 plus 1 Year warranty after registration\n",
          "Skin friendly blades with rounded tip to prevent irritation\n",
          "Note: Charge the appliance fully before you use it for the first time ; Contact_us on: [18001022929] for product related queries\n"
        ]
      },
      {
        "Reviews": [
          "  Very poor item, firstly , it you start , it start vibrating with huge noise , also you feel your hand start vibrating, felt like I am holding any big drilling machine, and the biggest drawback, other size modes are not working, only size 0 is working rest 1, 2,3,4,5,6,7,8,9 not working , waste of money, I am really surprised, why Amazon like trsut worthy online site allow such quality of item.\n",
          "  This is my second trimmer from Philips. I'm quite disappointed in this one. For a trimmer of that price it cuts very badly, doesn't give smooth cut. Secondly, the space between the blades and the comb clogs up easily causing the trimmer to jam frequently.The defective part... The on/off switch ceased to function properly within the first month of purchase. And exactly after two months the charger/adaptor stopped working. I'd say a trimmer of lower cost has performed way better\n",
          "  I bought this 3 months back and The product is good but i felt the price is bit high. i bought for Rs.1520. I expect it should range between 1000-1250.Pros====Duration is Good.Nice look.Smooth cutting.Cons======Can't use while chargingCharging time is 8-10 hours.\n",
          "  Update after 6 months use: skin got cut in sensitive areas like arm pit and edge of lips,if you use point 0 or not using the front comb. Bleeded multple times..Worst experience. I have the green trimmer from philips also, it is quite better in terms of safety to skin..People just give 1 star. Not the reason.  Here is the Real reason for 1 star.Dont buy if you want to trim long head hair above 20mm. Or 30mm or above that.It wont work to bring  to 5mm 10 mm.The front comb sucks. Doesn't guides. All the head hair stick to the head scalp only when you pass the trimmer. .May be good for facial hair. (Unfortunately I dont have). I bought to trim head hair growth due to lockdown.If you are trimming, All the trimmed hair,  will stuck in between the front comb and blades.The comb doesn't guide hair to the blades.All the hair which got cut stucks in between blade and comb. Every time after one movement, you need to remove the detachable comb and clean by blowing or with cleaning brush.Never buy trimmer with grill type comb. Always buy trimmer with bottom comb only - similar to saloon one..Else use a separate comb and trim.\n"
        ]
      },
      4,
      "SYSKA HT200U Beard Pro Trimmer Runtime: 40 Mins Cordless Use (Black)\n",
      "₹ 628.00",
      {
        "Highlights": [
          "Trimmer can be use for 40mins cordless\n",
          "5 length settings with 2mm precision\n",
          "Trimmer supports USB charging functions which makes it hassle-free while charging\n",
          "Blade material - self-sharpening stainless steel blades with advanced rototech technology\n",
          "HT200U is light weight and compact design\n",
          "Charging indicator\n",
          "Customer Care - Toll Free 1800-102-8787\n"
        ]
      },
      {
        "Reviews": [
          "  I cannot return product that is the main difficulty here .This trimmer create noise while running , not even local trimmer create that much sound .\n",
          "  Hair got stuck in blades each time i use it & need to clean by unloading blades with small comb. More to add here, battery life is also below average. DON'T BUY if want to have a SHAVE look as it doesn't cut below 0.50 and that looks odd/without shave. i couldn't notice its not replaceable/returnable, otherwise i would never purchase it. IT IS NOT GOOD PRODUCT.\n",
          "  Country of manufacturing is China. Vibrat too much. Otherwise looks solid. Trimmer box quality is not up to the mark.\n",
          "  No issueBest trimmer  under 1kNo issuesDon't  waste  your time  in watching  trimmer reviewsjust go for it......\n"
        ]
      }
    ]
  },
  {
    "Flipkart": [
      1,
      "Mi XXQ02HM  Runtime: 60 min Trimmer for Men",
      "₹899",
      {
        "Highlights": [
          "Blade Material: Stainless Steel",
          "Trimming Range: 0.5 - 10 mm",
          "60 min battery run time",
          "20 length settings",
          "Gender: Men",
          "For Beard & Moustache"
        ]
      },
      {
        "Reviews": [
          "While i was using this it was fully charged 3 indicator light. I have cutted my head hair and beard as well. Only 1 indicator down. Still almost it has 60% battery.Strong battery, no others brand can provide us on this price range except mi. Having Smooth cutting experience. I would like to strong recommend to everyone.READ MORE",
          "2 hours of charging 1 hour battery life is good comparing to my philips trimmer it takes 8 hours for 30 mins. Work like same as philips.Value for money.READ MORE",
          "Osm trimmer at this range . battery backup also good about to 60 min.light indication for battery backup is goodvery smooth in operating. easy to clean with removing blead.READ MORE",
          "Excellent product. Got it during the flash sale for 999. I have used a lot of trimmers before. But the build quality and comfort of this trimmer is very nice. You can use micro USB  cable to charge. Functions pretty smoothly and you also get a pouch to store while traveling which nobody else provides. The only con is adapter is not included in the box.READ MORE"
        ]
      },
      2,
      "PHILIPS BT1212/15  Runtime: 30 min Trimmer for Men",
      "₹840",
      {
        "Highlights": [
          "Blade Material: Stainless Steel",
          "Trimming Range: 1 - 7 mm",
          "30 min battery run time",
          "4 length settings",
          "Gender: Men",
          "For Hair Clipping"
        ]
      },
      {
        "Reviews": [
          "I got this Philips trimmer on 14 July 2018 now in July 2019 means after 1 year battery is not working. I charge it 8 to 9 hours and it works for 30 seconds only. Philips disappointed me. It's not expected.After one year battery backup is wrost. Flipkart doesn't show last review the show best review on topREAD MORE",
          "The trimmer is very good weight is very light and shaving experience is smooth and comfortable and trimming power of blades is superb easy to clean.READ MORE",
          "TRIMMER IS WORKING IS VERY WELL. JUST IT MAKES A LIL BIT OF SOUND. I will give more reviews after using it for some days. The trimmer is very powerful & gives a smooth trimming experience. Some YouTube videos show that this trimmer use very low quality of plastic bit it is not true,, rather it uses a fine & excellent quality of plastic with easy grip. One thing more to say that, I have given 4 stars because the delivery of the product is too late. It delivered the product at the 7th day.READ MORE",
          "Hey hi, I've been a customer for last 6 years. Since I've ordered 4 mobiles, a pendrive, an headset and a trimmer. This is my 1st review about Flipkart delivery.I've never facing any issues with Flipkart till now and my favourite dealer Ekart Logistics. What a great service. Really I appreciate your perfection.Yesterday I got my new trimmer Philips BT1212/15 in an offer. Such an awesome product. Go with this guys. Flipkart, you're always doing your job better with excellent services. I real...READ MORE"
        ]
      },
      3,
      "NOVA NHT 1073-00 USB  Runtime: 60 min Trimmer for Men",
      "₹649",
      {
        "Highlights": [
          "Blade Material: Stainless Steel",
          "Trimming Range: 0.5 - 12 mm",
          "60 min battery run time",
          "5 length settings",
          "Gender: Men",
          "For Beard & Moustache, Body Grooming"
        ]
      },
      {
        "Reviews": [
          "after 3 time use I rate this product as the best in the market with this price range. I waited to buy Philips product as they are the top selling trimmer brand. but I can't afford it. so I opted Nova brand. and I'm happy with this productREAD MORE",
          "Wowwwww😱😱😱😱 amazing lovely product...... No. 1 product awesome..... 😍😍😍😛😘😘😘 i love it..... It is a very great product.... Flipkart thank you so much because first time i bought to flipkart and product is very good good good good👍😇😇😇 so thank you so muchREAD MORE",
          "Its very nice & strong product, it's looking great.. smooth sound, smoothly cutting hair & beard...Delivery very fast & great, I so happy flipkart..READ MORE",
          "Honest review. Awesome purchase and a very happy customer. Main reason was to cut out hair during this lockdown as Saloons are closed. Great product I cut my son's hair with few minutes. So smooth and easy. Don't think and just go for it.READ MORE"
        ]
      },
      4,
      "Mi XXQ01HM  Runtime: 90 min Trimmer for Men",
      "₹1,199",
      {
        "Highlights": [
          "Blade Material: Stainless Steel",
          "Trimming Range: 0.5 - 20 mm",
          "90 min battery run time",
          "40 length settings",
          "Gender: Men",
          "For Beard & Moustache"
        ]
      },
      {
        "Reviews": [
          "Take a look if you wanted to look insideRemember YOU DONT GET THE CHARGING ADAPTER IN THE BOX (You get only cable).What i liked:- Mi brand ( You may or maynot like )- usb like charging  cable. Can charge with a power bank too.- Design.- charging backup ( you can easily trim more then an hour with a full charge)- battery indicators ( much useful)what i didn't like:- the blade gets hot after 5 min of usage. i didn't observe this on my philips trimmer.- The clips are delicate to my op...READ MORE",
          "Amazing Product Small and Compact Easy To Carry Awesome Battery Life And Its Looks Is Just Amazing😍😍😍😍READ MORE",
          "i like the build quality..it's excellent and even the adjustment is smooth AF and the pouch provided in the box is pretty useful too the fact i didn't like is its motor.. i was expecting it to be more smoth..overall i like the product ..... Okay it's been almost a month and m facing some problems..1:- probably it's not a product for small moustache (much)      Trimming comb are too huge for small moustache.      kinda like it's designed for big beard man or  hair cut.  2:- And it heat ...READ MORE",
          "writing after 10days of using the product. and I do not recommend this product. (Phillips trimmed - best designed )pro : looks and feel good to hold.cons : 1. finding difficult to use on right and left sides of my face(sharpening/shaping/structure). the design is not good for users.not user friendly. 2. when I used to trim at level 2 or 3 the results were worst not even. some places it went to level 1 or 0 and 2.i.e) am not getting same level of trimmed beard. the final out put is not good.READ MORE"
        ]
      }
    ]
  }
]
